content/writing/fpp-abstractions/index.md
+++
title = "Functional people abstractions"
author = ["benford"]
lastmod = 2019-07-11T12:51:22+01:00
tags = ["article"]
type = "article"
draft = false
+++

One of the primary drives programmers have is to uncover and use the right
abstractions. That's also one of the things that draws people to functional
programming: the abstractions we use in FP are fundamental, atomic and based on
maths and logic.

<!--more-->

The main reason we seek abstractions like this are so that we
can decrease cognitive overhead by [Chunking](https://en.wikipedia.org/wiki/Chunking%5F(psychology)) knowledge into composable, related
concepts.

What if you could use the same principle, and even some of the same
abstractions, to reason about people and teams delivering software?

So what might some fundamental abstractions look like for teams and the process
of shipping code? What we're looking for here are some mental models&nbsp;[^fn:1]


## What makes a good abstraction? {#what-makes-a-good-abstraction}

Before we dive into this I want to take just a short detour to put some
constraints around what benefits we want to accrue from the mental tools we choose.


## The OODA loop {#the-ooda-loop}


### Observe {#observe}


### Orient {#orient}


### Decide {#decide}


### Act {#act}


### Destruction and Creation {#destruction-and-creation}

[^fn:1]: <https://fs.blog/mental-models/>
